<?php
/**
 * Created by PhpStorm.
 * User: vitalykhy
 * Date: 07.07.16
 * Time: 23:37
 */

return [
    1 => 'Не передан шаблон для view. Ошибка возникла на строке #line# файла #file# функции #function#.',
    2 => 'Нет такого шаблона. Ошибка возникла на строке #line# файла #file# функции #function#.',
    3 => 'Не задана тема. Ошибка возникла на строке #line# файла #file# функции #function#.',
    4 => 'Такого контроллера не существует. Ошибка возникла на строке #line# файла #file# функции #function#.',
];