<?php

return [
		/**
		 * Нумерация делается с 1.
		 * Список полей статичен.
		 * Список типов сравнений статичен.
		 */
    //Список названий полей в таблицах l_sequence_4_user_
    'list_fields_name' => [
        1 => 'geo',//В l_sequence_4_user_ это поле geo
        2 => 'ips',//В l_sequence_4_user_ это поле geo
        3 => 'domain_text',
        4 => 'link_text',
				5 => 'seance',
        6 => 'order',
        7 => 'hour',
        8 => 'time',
        9 => 'uuid',
        10 => 'step',
        11 => 'duration',
        12 => 'referer_link',
        13 => 'referer_domain',
        14 => 'utm_term',
        15 => 'utm_content',
        16 => 'utm_source',
        17 => 'utm_medium',
        18 => 'utm_campaign',
        19 => 'device',
				20 => 'ip',//Используется для выбора диапазона IP
				21 => 'ip'//Используется для указания конкретного IP
    ],
    //Список полей для условий
    'list_fields' => [
        1 => 'Города',
        2 => 'Провайдеры',
        3 => 'Домены',
        4 => 'Ссылки',
				5 => 'Сеансы',
        6 => 'Заявки',
        7 => 'Часы',
        8 => 'Время',
        9 => 'Идентификатор uuid',
        10 => 'Шаг',
        11 => 'Продолжительность',
        12 => 'Ссылки реферов',
        13 => 'Домены реферов',
        14 => 'UTM метка term',
        15 => 'UTM метка content',
        16 => 'UTM метка source',
        17 => 'UTM метка medium',
        18 => 'UTM метка campaign',
        19 => 'Устройство',
        20 => 'Диапазон IP',
        21 => 'IP адрес'
    ],
    //Список типов сравнения для условий
    'list_conditions_type' => [
        1 => 'Точно соответствует',
        2 => 'Содержит',
        3 => 'Начинается с',
        4 => 'Заканчивается на',
        5 => 'Соответствует регулярному выражению',
        6 => 'Является одним из',
        7 => 'Не является точным соответствием',
        8 => 'Не содержит',
				9 => 'Интервал',
				10 => 'Больше',
				11 => 'Больше (день)',
				12 => 'Больше (неделя)',
				13 => 'Больше (месяц)',
				14 => 'Равно',
				15 => 'Равно (день)',
				16 => 'Равно (неделя)',
				17 => 'Равно (месяц)',
				18 => 'Меньше',
				19 => 'Меньше (день)',
				20 => 'Меньше (неделя)',
				21 => 'Меньше (месяц)',
				22 => 'Маска сети',
        23 => 'Соответствует IP'
    ],
    //Список полей, для которых будут выборочные условия
    'list_fields_selective_conditions' => [
        1 => [
            1
        ],
        2 => [
            1
        ],
				3 => [
            1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
        ],
        4 => [
            1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
        ],
        5 => [
            1
        ],
				6 => [
						1
				],
				7 => [
						1, 10, 14, 18
				],
				8 => [
						9, 11, 12, 13, 15, 16, 17, 19, 20, 21
				],
				9 => [
						1
				],
				10 => [
						9
				],
				11 => [
						9
				],
				12 => [
						1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
				],
				13 => [
						1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
				],
				14 => [
						1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
				],
				15 => [
						1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
				],
				16 => [
						1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
				],
				17 => [
						1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
				],
				18 => [
						1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
				],
				19 => [
						1
				],
				20 => [
						22
				],
        21 => [
            23
        ]
    ],
    //Список полей, для которых будут подгружатся значения через ajax
    'list_fields_load_values' => [
        2 => 'ips',
        1 => 'geo',
				20 => 'ip_diap'
    ],
		//Список полей и условий, для которых должен подгружаться datepicker
		//Здесь ключ - это поле, а значение - это тип сравнения
		'list_dp' => [
			8 => 9
		],
		//Список полей, для которых будут подгружаться значения в виде статичного выпадающего списка
		'list_fields_static_values' => [
				6 => [
						1 => 'Да',
						0 => 'Нет'
				],
				7 => [
						0 => '01:00',
						1 => '02:00',
						2 => '03:00',
						3 => '04:00',
						4 => '05:00',
						5 => '06:00',
						6 => '07:00',
						7 => '08:00',
						8 => '09:00',
						9 => '10:00',
						10 => '11:00',
						11 => '12:00',
						12 => '13:00',
						13 => '14:00',
						14 => '15:00',
						15 => '16:00',
						16 => '17:00',
						17 => '18:00',
						18 => '19:00',
						19 => '20:00',
						20 => '21:00',
						21 => '22:00',
						22 => '23:00',
						23 => '00:00'
				],
				19 => [
						1 => 'Не определен',
						2 => 'Мобайл',
						3 => 'Планшет',
						4 => 'Десктоп'
				]
		]
];
