<?php
/**
 * Created by PhpStorm.
 * User: vitalykhy
 * Date: 18.07.16
 * Time: 15:48
 */

return [
    1 => "\nНет файла c подключениями к базе данных. Ошибка возникла на строке #line# файла #file# функции #function#.\n",
    2 => "\nНет файла конфигурации по умолчанию. Ошибка возникла на строке #line# файла #file# функции #function#.\n",
    3 => "\nНеправильные данне для подключения к базе данных. Ошибка возникла на строке #line# файла #file# функции #function#.\n",
    4 => "\nОшибка при подключении к базе данных. Ошибка возникла на строке #line# файла #file# функции #function#.\n",
    5 => "\nСервис генерации ключей вышел из строя. Ошибка возникла на строке #line# файла #file# функции #function#.\n",
];