<div class="alert alert-info">
	<p>В данном разделе можно просомотреть статистику по событиям.
	В первой части можно выбрать список параметров, по которым будет производится фильтрация.
	Стоит иметь ввиду, что поле <b>Канал</b> производит фильтрацию по полю utm_medium.
	Также фильтрация по meta тэгам возможна с помощью регулярных выражений.</p>
	<p>
		Раздел группировка производит группировку по одному из возможных полей и выводит количество записей по этой группировке.
	</p>
	<p>
		Раздел пересечения является приоритетным, то есть если выбраны какие-либо другие фильтры, то они будут проигнорированы. Нельзя сделать пересечение по определенной выборке, кроме как выборки по площадке.
	</p>
</div>